# Host: localhost  (Version 5.7.26)
# Date: 2024-01-24 14:02:37
# Generator: MySQL-Front 6.0  (Build 2.20)


#
# Structure for table "coupon"
#

DROP TABLE IF EXISTS `coupon`;
CREATE TABLE `coupon` (
  `couponId` int(11) NOT NULL,
  `couponName` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `expiration` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `remission` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `descption` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `tag` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`couponId`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='优惠券';

#
# Data for table "coupon"
#

/*!40000 ALTER TABLE `coupon` DISABLE KEYS */;
INSERT INTO `coupon` VALUES (1,'永久优惠券','1768612814','200','一张长期的优惠券','长期'),(2,'临时优惠券','1704771514','200','短期内会过期',NULL);
/*!40000 ALTER TABLE `coupon` ENABLE KEYS */;

#
# Structure for table "dict"
#

DROP TABLE IF EXISTS `dict`;
CREATE TABLE `dict` (
  `id` int(11) NOT NULL,
  `dictParam` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `dictName` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `dictValue` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

#
# Data for table "dict"
#

/*!40000 ALTER TABLE `dict` DISABLE KEYS */;
INSERT INTO `dict` VALUES (1,'order_status','出票成功',1),(2,'order_status','未支付',0),(3,'order_status','已过期',2);
/*!40000 ALTER TABLE `dict` ENABLE KEYS */;

#
# Structure for table "order"
#

DROP TABLE IF EXISTS `order`;
CREATE TABLE `order` (
  `userId` int(255) NOT NULL,
  `cinemaId` int(255) NOT NULL,
  `cinemaName` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `showAt` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `endAt` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `hallId` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `hallName` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `filmId` int(11) DEFAULT NULL,
  `filmName` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `scheduleId` int(50) DEFAULT NULL,
  `orderId` int(11) NOT NULL AUTO_INCREMENT,
  `status` int(1) DEFAULT '0' COMMENT '0:未支付，1:已支付',
  `price` int(11) DEFAULT '0',
  `actualPrice` int(11) DEFAULT NULL COMMENT '实际价格',
  `oNum` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `poster` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `createDate` int(11) DEFAULT NULL,
  `cinemaPhone` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `tradeNo` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `tradeTime` int(255) DEFAULT NULL,
  PRIMARY KEY (`orderId`)
) ENGINE=MyISAM AUTO_INCREMENT=60 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

#
# Data for table "order"
#

/*!40000 ALTER TABLE `order` DISABLE KEYS */;
INSERT INTO `order` VALUES (1,876,'中影德金影城和平店','1704942600','1704949620','71512181','5号厅 双人观影免费停车',6664,'年会不能停！',409653423,45,2,3800,34,'k3a-8cc-k0s-3ta-4abt7odjk','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704937366,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1704942600','1704949620','71512181','5号厅 双人观影免费停车',6664,'年会不能停！',409653423,46,2,3800,3400,'oef-85l-h2h-66e-ojfsqtsgo','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704938667,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1705112400','1705119420','71512179','3号厅 双人观影免费停车',6664,'年会不能停！',409668261,47,2,3800,NULL,'d50-vkh-5tf-3vr-2klr2an0j','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704938867,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1704943200','1704950700','71512177','1号厅 双人观影免费停车',6661,'金手指',409653424,48,2,3800,NULL,'ask-iiv-4qb-8ud-8qp3aqeo8','https://pic.maizuo.com/usr/movie/37c604f9c5c165b8fd110a926037f8c1.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704939366,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1704943200','1704950700','71512177','1号厅 双人观影免费停车',6661,'金手指',409653424,49,2,3800,NULL,'m3g-hpm-pi9-vk3-vt90ub7ui','https://pic.maizuo.com/usr/movie/37c604f9c5c165b8fd110a926037f8c1.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704939500,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1704954000','1704961020','71512179','3号厅 双人观影免费停车',6664,'年会不能停！',409653431,50,2,3800,3800,'p3a-t4v-sq7-crm-lg2ocoj84','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704951699,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1704961800','1704968820','71512179','3号厅 双人观影免费停车',6664,'年会不能停！',409653436,51,2,7600,NULL,'j05-nli-do9-5sc-cgvr0raqd','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1704959505,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1705028400','1705035420','71512179','3号厅 双人观影免费停车',6664,'年会不能停！',410125047,52,2,3800,3800,'8uu-2je-15o-dbt-duf9mitei','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1705026044,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1705044300','1705051320','71512179','3号厅 双人观影免费停车',6664,'年会不能停！',410125057,53,2,11400,11000,'1ch-a6n-e4i-nl7-2gr67p0c7','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1705041139,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1705053600','1705059360','71512181','5号厅 双人观影免费停车',6729,'动物园里有什么？',409905555,54,2,7600,7200,'n20-tp5-9h6-q8t-866hqfr8l','https://pic.maizuo.com/usr/movie/2f70f5ba75603b41a6934cfbf95372d1.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1705049820,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1705053600','1705059360','71512181','5号厅 双人观影免费停车',6729,'动物园里有什么？',409905555,55,2,7600,NULL,'cga-nl8-8uc-hhk-0ltspjbp0','https://pic.maizuo.com/usr/movie/2f70f5ba75603b41a6934cfbf95372d1.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1705049892,'0755-29971666',NULL,NULL),(1,12682,'金水湾影城（西柳店）','1705312800','1705318560','61487453','3号超清激光厅',6729,'动物园里有什么？',411154173,56,2,6600,NULL,'4rv-glp-kkq-5si-4a0ufqdsm','https://pic.maizuo.com/usr/movie/2f70f5ba75603b41a6934cfbf95372d1.jpg','海城市西柳镇广美路7号物流园北侧',1705303289,NULL,NULL,NULL),(1,10829,'万达影城（南京浦口白马广场店）','1705317600','1705324620','241142','口味王3号厅',6664,'年会不能停！',409048941,57,2,8380,8380,'il9-nph-aev-qjg-248vf17jh','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','浦口区狮山路5-1号白马广场四楼万达影城',1705303743,'025-68895500',NULL,NULL),(1,990,'嘉定影剧院','1705316400','1705323420','71491446','2号厅',6664,'年会不能停！',410908253,58,2,7600,7600,'6o7-c5q-g85-mhi-7pputlc39','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','嘉定区城中路149号（城中路人民街）',1705303986,'021-59531306',NULL,NULL),(1,990,'嘉定影剧院','1705316400','1705323420','71491446','2号厅',6664,'年会不能停！',410908253,59,2,7600,7600,'efb-vgq-3lf-uua-jv0m5a197','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','嘉定区城中路149号（城中路人民街）',1705304737,'021-59531306',NULL,NULL),(1,4876,'北京地质礼堂影院','1705386000','1705393020','951c68674755bb0f','二号厅●儿童不免票',6664,'年会不能停！',410390960,60,2,3420,3420,'6pe-b43-a63-2ci-0m91k79p0','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','北京市西四羊肉胡同30号',1705364278,'010-66168376/010-66178928',NULL,NULL),(1,848,'北京博纳影城悠唐店','1705393800','1705400820','8474d66482622c71','2号激光巨幕厅',6664,'年会不能停！',409558896,61,2,10800,10400,'i7h-35h-b3j-qcc-28st4evjf','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','三丰北里2号楼悠唐生活广场B1层（朝阳门钱柜对面）',1705388500,'010-59775660',NULL,NULL),(1,4876,'北京地质礼堂影院','1705455600','1705462620','951c68674755bb0f','二号厅●儿童不免票',6664,'年会不能停！',411829502,62,2,6840,NULL,'v3c-ekg-4ir-uel-8qp805ctu','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','北京市西四羊肉胡同30号',1705450042,'010-66168376/010-66178928',NULL,NULL),(1,4876,'北京地质礼堂影院','1705473900','1705480920','4ff7dacba3abd974','四号厅●儿童不免票',6664,'年会不能停！',412028612,63,2,6840,6840,'cce-dki-buc-395-5b3c6gpfl','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','北京市西四羊肉胡同30号',1705454170,'010-66168376/010-66178928',NULL,NULL),(1,4075,'上海黄浦剧场','1705475100','1705481400','71550649','1',6730,'养蜂人',410467025,64,2,21500,NULL,'f8d-ihg-tfv-7dh-9vggvrp4g','https://pic.maizuo.com/usr/movie/9a2dd7d107f4cd295987be00a98ab401.jpg','上海市北京东路780号（近贵州路）',1705454357,'021-63508739',NULL,NULL),(1,13664,'春天国际影城（上海蛙城店）','1705473000','1705480020','71534398','2号厅',6664,'年会不能停！',411731616,65,2,20400,20200,'ojf-8co-pfk-a6f-lkefli1kq','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','青浦区盈浦街道淀山湖大道东渡蛙城3层',1705454479,NULL,NULL,NULL),(1,4075,'上海黄浦剧场','1705468200','1705473960','71550649','1',6729,'动物园里有什么？',410467024,66,2,7600,NULL,'mvp-pgk-6r4-cvo-tephvbfpo','https://pic.maizuo.com/usr/movie/2f70f5ba75603b41a6934cfbf95372d1.jpg','上海市北京东路780号（近贵州路）',1705458508,'021-63508739',NULL,NULL),(1,13664,'春天国际影城（上海蛙城店）','1705477200','1705484700','71534403','7号厅',6681,'海王2：失落的王国',411731619,67,2,8560,8360,'elp-deh-i93-igg-j6molcl75','https://pic.maizuo.com/usr/movie/b451d49006e099c08c5e59db27fdb325.jpg','青浦区盈浦街道淀山湖大道东渡蛙城3层',1705458727,NULL,NULL,NULL),(1,1000,'SFC上影影城（新世界店）','1705467600','1705475520','4338adeab27097db','2号厅',6660,'三大队',411500537,68,2,10000,NULL,'fna-56k-8ne-10k-i39enhjjc','https://pic.maizuo.com/usr/movie/9bb7b0f4d4256fd386b90b55d2094199.jpg','上海市黄浦区南京西路2-68号新世界12楼',1705461047,'021-63594933',NULL,NULL),(1,1000,'SFC上影影城（新世界店）','1705467600','1705475520','4338adeab27097db','2号厅',6660,'三大队',411500537,69,2,10000,10000,'3m7-qoa-6kh-6ir-kjcs79sn8','https://pic.maizuo.com/usr/movie/9bb7b0f4d4256fd386b90b55d2094199.jpg','上海市黄浦区南京西路2-68号新世界12楼',1705461088,'021-63594933',NULL,NULL),(1,990,'嘉定影剧院','1705488300','1705495320','71491446','2号厅',6664,'年会不能停！',411741449,70,2,7600,NULL,'k3j-udc-djp-j0d-43h90pbcl','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','嘉定区城中路149号（城中路人民街）',1705475081,'021-59531306',NULL,NULL),(1,9813,'鞍山中影国际影城（CGS中国巨幕碧乐城店）','1705484100','1705490400','22705','1号全国艺术联盟激光厅',6730,'养蜂人',411061096,71,2,6600,6400,'vtp-61p-p3a-ei9-10m1tkoct','https://pic.maizuo.com/usr/movie/9a2dd7d107f4cd295987be00a98ab401.jpg','辽宁省鞍山市铁东区二道街万熹购物公园七层中影国际影城',1705482255,'0412-2200668',NULL,NULL),(1,12694,'中影超达影城（台安店）','1705545000','1705552020','71526860','2号厅',6664,'年会不能停！',412291032,72,2,6600,NULL,'r6j-skf-eaf-6qs-pc65svd1a','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','台安县金山都市汇四楼',1705537234,'0412-4868886',NULL,NULL),(1,4111,'海城万和国际影城','1705542000','1705549500','65953166','3号ALPD激光厅',6661,'金手指',412227337,73,2,3300,NULL,'b35-bve-j5h-29f-i6t4akog9','https://pic.maizuo.com/usr/movie/37c604f9c5c165b8fd110a926037f8c1.jpg','鞍山市海城市海州区北关万和城6楼',1705537457,'0412-3385858',NULL,NULL),(1,12694,'中影超达影城（台安店）','1705575600','1705582620','71526860','2号厅',6664,'年会不能停！',412291042,74,2,3300,NULL,'31d-5kr-pcs-8ob-olvtj23cv','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','台安县金山都市汇四楼',1705562918,'0412-4868886',NULL,NULL),(1,289,'金逸影城（万象汇店）','1705721400','1705727220','4','4号超清激光厅',6716,'花千骨',412594645,75,2,9900,NULL,'cdf-bdq-464-s93-17bmgcetb','https://pic.maizuo.com/usr/movie/7aa38ddd6f83b197270388ebe525f077.jpg','辽宁省鞍山市铁东区建国南路48号乐都汇购物广场五楼金逸影城',1705624501,'0412-8770264',NULL,NULL),(1,289,'金逸影城（万象汇店）','1705742400','1705748220','4','4号超清激光厅',6716,'花千骨',412594663,76,2,6600,6600,'g5d-uf1-vb1-qhc-d479rf984','https://pic.maizuo.com/usr/movie/7aa38ddd6f83b197270388ebe525f077.jpg','辽宁省鞍山市铁东区建国南路48号乐都汇购物广场五楼金逸影城',1705624816,'0412-8770264',NULL,NULL),(1,12692,'岫岩华钠影城','1705630500','1705636020','142600','4',6685,'舒克贝塔·五角飞碟',412631014,77,2,6600,NULL,'gsb-me6-6j5-asf-g0b7qfsci','https://pic.maizuo.com/usr/movie/c69a3f034026ee70982cdc26ebed7ca2.jpg','岫岩满族自治县会展中心西南门二楼华钠影城',1705626411,'0412-7788833',NULL,NULL),(1,12692,'岫岩华钠影城','1705630500','1705636020','142600','4',6685,'舒克贝塔·五角飞碟',412631014,78,2,6600,NULL,'r7d-dnb-deq-spm-d0roc64ho','https://pic.maizuo.com/usr/movie/c69a3f034026ee70982cdc26ebed7ca2.jpg','岫岩满族自治县会展中心西南门二楼华钠影城',1705626738,'0412-7788833',NULL,NULL),(1,9813,'鞍山中影国际影城（CGS中国巨幕碧乐城店）','1705631400','1705638300','22708','4号激光厅',6664,'年会不能停！',411347746,79,2,5600,NULL,'e5p-qgf-odf-3ak-h9p7fl8au','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','辽宁省鞍山市铁东区二道街万熹购物公园七层中影国际影城',1705629435,'0412-2200668',NULL,NULL),(1,4954,'北京首都电影院西单店','1705658700','1705664520','0000000000000014','VIP厅',6714,'临时劫案',412576618,80,2,24600,NULL,'m45-7p5-gc8-59k-53e981pee','https://pic.maizuo.com/usr/movie/0b878942790318d209c1ba4acda296e5.jpg','北京市西城区西单北大街甲131号大悦城商场十层',1705631223,'010-66062266',NULL,NULL),(1,876,'中影德金影城和平店','1705998600','1706005020','71512178','2号厅 双人观影免费停车',6666,'一闪一闪亮星星',414441933,81,2,19000,18800,'62r-vlo-cdv-0so-vvsj5teo9','https://pic.maizuo.com/usr/movie/6c47eb5dc41e76cb7eaa8b48198cb486.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1705996996,'0755-29971666',NULL,NULL),(1,876,'中影德金影城和平店','1705998600','1706005020','71512178','2号厅 双人观影免费停车',6666,'一闪一闪亮星星',414441933,82,2,7600,NULL,'fqs-hko-7lk-95n-ba14na9uk','https://pic.maizuo.com/usr/movie/6c47eb5dc41e76cb7eaa8b48198cb486.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1705997129,'0755-29971666',NULL,NULL),(1,8119,'英皇电影城（东海缤纷店）','1705999200','1706006700','0000000000000007','7号VIP厅',6661,'金手指',413022227,83,2,14300,NULL,'q42-pfk-hm7-lu2-i7g9lbefh','https://pic.maizuo.com/usr/movie/37c604f9c5c165b8fd110a926037f8c1.jpg','深圳市福田区东海缤纷天地商场B1层',1705998523,'0755-32935088',NULL,NULL),(1,4601,'深圳百川影城IMAX新沙天虹店','1706063100','1706070120','0000000000000003','3号厅',6664,'年会不能停！',413211852,84,2,3700,NULL,'51v-j9j-ihj-prr-rgvrnjpen','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区沙井街道西环路2105号新沙天虹7楼',1706057311,'0755-29891309',NULL,NULL),(1,876,'中影德金影城和平店','1706070000','1706077020','71512178','2号厅 双人观影免费停车',6664,'年会不能停！',414705589,85,2,11400,11200,'otq-p3l-chj-a1p-h4dk72bmv','https://pic.maizuo.com/usr/movie/24c343e5bed9f0e75b4a676e77d591ae.jpg','宝安区福永镇和平村桥和路315号（德金财富广场）',1706058100,'0755-29971666',NULL,NULL);
/*!40000 ALTER TABLE `order` ENABLE KEYS */;

#
# Structure for table "seat"
#

DROP TABLE IF EXISTS `seat`;
CREATE TABLE `seat` (
  `seatId` int(11) NOT NULL AUTO_INCREMENT,
  `orderId` int(11) NOT NULL DEFAULT '0',
  `columnId` varchar(11) COLLATE utf8_unicode_ci NOT NULL DEFAULT '0',
  `columnNum` int(11) NOT NULL DEFAULT '0',
  `rowId` varchar(11) COLLATE utf8_unicode_ci NOT NULL DEFAULT '0',
  `rowNum` int(20) NOT NULL DEFAULT '0',
  `sectionId` varchar(20) COLLATE utf8_unicode_ci NOT NULL DEFAULT '0',
  `sectionName` varchar(50) COLLATE utf8_unicode_ci NOT NULL DEFAULT '0',
  PRIMARY KEY (`seatId`)
) ENGINE=MyISAM AUTO_INCREMENT=190 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

#
# Data for table "seat"
#

/*!40000 ALTER TABLE `seat` DISABLE KEYS */;
INSERT INTO `seat` VALUES (43,30,'5',0,'3',3,'1','普通'),(44,30,'6',0,'3',3,'1','普通'),(45,31,'7',0,'4',4,'1','普通'),(46,31,'8',0,'4',4,'1','普通'),(47,32,'6',0,'3',3,'1','普通'),(48,32,'7',0,'4',4,'1','普通'),(49,32,'8',0,'4',4,'1','普通'),(50,33,'3',0,'7',7,'1',''),(51,34,'4',0,'5',5,'1',''),(52,34,'7',0,'8',8,'1',''),(53,35,'2',0,'3',3,'1',''),(54,36,'3',0,'4',4,'1',''),(55,36,'4',0,'6',6,'1',''),(56,37,'4',0,'4',4,'1',''),(57,38,'5',0,'7',7,'1',''),(58,39,'3',0,'6',6,'1',''),(59,40,'8',0,'9',9,'1',''),(60,40,'9',0,'9',9,'1',''),(61,41,'5',10,'3',3,'1',''),(62,41,'6',11,'3',3,'1',''),(63,42,'10',12,'8',8,'1',''),(64,43,'6',6,'3',3,'1','普通'),(65,43,'6',6,'4',4,'1','普通'),(66,44,'7',7,'4',4,'1','普通'),(67,44,'9',9,'4',4,'1','普通'),(68,45,'8',8,'3',3,'1','普通'),(69,45,'9',9,'3',3,'1','普通'),(70,45,'10',10,'3',3,'1','普通'),(71,45,'10',10,'4',4,'1','普通'),(72,45,'8',8,'4',4,'1','普通'),(73,46,'4',6,'6',6,'1','普通'),(74,46,'5',7,'7',7,'1','普通'),(75,47,'7',7,'3',3,'1','普通'),(76,48,'8',8,'5',5,'1','普通'),(77,48,'9',9,'4',4,'1','普通'),(78,49,'8',8,'3',3,'1','普通'),(79,49,'9',9,'3',3,'1','普通'),(80,50,'8',8,'4',4,'1','普通'),(81,50,'9',9,'4',4,'1','普通'),(82,51,'6',6,'3',3,'1','普通'),(83,51,'6',8,'7',7,'1','普通'),(84,52,'9',9,'4',4,'1','普通'),(85,52,'9',9,'5',5,'1','普通'),(86,53,'8',8,'2',2,'1','普通'),(87,53,'9',9,'3',3,'1','普通'),(88,54,'5',5,'4',4,'1','普通'),(89,54,'6',6,'4',4,'1','普通'),(90,54,'7',7,'4',4,'1','普通'),(91,55,'6',6,'2',2,'1','普通'),(92,55,'6',6,'3',3,'1','普通'),(93,55,'7',7,'3',3,'1','普通'),(94,56,'5',5,'4',4,'1','普通'),(95,56,'4',4,'4',4,'1','普通'),(96,57,'5',5,'3',3,'1','普通'),(97,57,'6',6,'3',3,'1','普通'),(98,58,'7',7,'2',2,'1','普通'),(99,58,'7',7,'1',1,'1','普通'),(100,63,'6',17,'3',3,'5625493863097993218','普通区'),(101,63,'5',18,'4',4,'5625493863097993218','普通区'),(102,64,'9',14,'3',3,'5625493863097993218','普通区'),(103,64,'8',15,'3',3,'5625493863097993218','普通区'),(104,64,'7',16,'4',4,'5625493863097993218','普通区'),(105,65,'8',15,'7',7,'5625493863097993218','普通区'),(106,65,'9',16,'8',8,'5625493863097993218','普通区'),(107,66,'4',7,'7',7,'1','普通'),(108,67,'6',9,'6',6,'1','普通'),(109,68,'11',11,'3',3,'1','普通'),(110,69,'9',9,'3',3,'1','普通'),(111,70,'7',7,'3',3,'1','普通'),(112,70,'8',8,'4',4,'1','普通'),(113,71,'9',9,'3',3,'1','普通'),(114,72,'5',5,'2',2,'1','普通'),(115,73,'8',8,'3',3,'1','普通'),(116,74,'9',9,'4',4,'1','普通'),(117,75,'5',8,'6',6,'1','普通'),(118,76,'10',10,'5',5,'1','普通'),(119,77,'11',11,'3',3,'1','普通'),(120,78,'7',7,'3',3,'1','普通'),(121,79,'7',7,'3',3,'1','普通'),(122,80,'9',9,'3',3,'1','普通'),(123,33,'6',12,'3',3,'1',''),(124,34,'7',6,'3',3,'1','普通'),(125,34,'6',7,'4',4,'1','普通'),(126,35,'5',8,'3',3,'1','普通'),(127,35,'4',9,'3',3,'1','普通'),(128,36,'4',9,'3',3,'1','普通'),(129,37,'6',7,'2',2,'1','普通'),(130,37,'7',6,'3',3,'1','普通'),(131,37,'7',6,'2',2,'1','普通'),(132,38,'4',6,'2',3,'9999999999','默认分区'),(133,38,'4',8,'4',7,'9999999999','默认分区'),(134,39,'10',15,'6',7,'9999999999',''),(135,39,'11',16,'7',8,'9999999999',''),(136,39,'12',17,'7',8,'9999999999',''),(137,39,'14',17,'8',9,'9999999999',''),(138,39,'13',16,'8',9,'9999999999',''),(139,40,'14',25,'7',7,'0','默认分区'),(140,40,'14',25,'10',10,'0','默认分区'),(141,40,'16',26,'11',11,'0','默认分区'),(142,40,'16',26,'12',12,'0','默认分区'),(143,42,'4',7,'B',2,'3076','优享区'),(144,42,'3',8,'C',3,'3076','优享区'),(145,43,'5',6,'C',3,'3076','优享区'),(146,44,'6',6,'2',2,'1','普通'),(147,45,'6',6,'1',1,'1','普通'),(148,46,'3',3,'2',2,'1','普通'),(149,47,'8',5,'5',5,'1','普通'),(150,48,'8',8,'3',3,'1','普通'),(151,49,'7',7,'3',3,'1','普通'),(152,50,'5',8,'3',3,'1','普通'),(153,51,'4',9,'2',2,'1','普通'),(154,51,'4',9,'3',3,'1','普通'),(155,52,'5',8,'3',3,'1','普通'),(156,53,'6',7,'2',2,'1','普通'),(157,53,'5',8,'3',3,'1','普通'),(158,53,'5',8,'2',2,'1','普通'),(159,54,'7',7,'4',4,'1','普通'),(160,54,'7',7,'3',3,'1','普通'),(161,55,'6',6,'2',2,'1','普通'),(162,55,'5',5,'2',2,'1','普通'),(163,57,'7',8,'3',3,'32',''),(164,57,'8',9,'3',3,'32',''),(165,58,'4',10,'5',5,'0','默认分区'),(166,58,'6',11,'6',6,'0','默认分区'),(167,59,'6',11,'5',5,'0','默认分区'),(168,59,'8',12,'2',2,'0','默认分区'),(169,60,'5',5,'2',2,'1',''),(170,61,'15',16,'6',6,'0',''),(171,61,'16',17,'7',7,'0',''),(172,62,'6',6,'3',3,'1',''),(173,62,'7',7,'3',3,'1',''),(174,63,'3',6,'3',3,'1',''),(175,63,'3',6,'4',4,'1',''),(176,64,'8',22,'10',10,'0','默认分区'),(177,64,'10',23,'10',10,'0','默认分区'),(178,64,'12',24,'12',12,'0','默认分区'),(179,64,'12',24,'11',11,'0','默认分区'),(180,64,'12',24,'10',10,'0','默认分区'),(181,65,'7',8,'3',3,'0','默认分区'),(182,65,'3',12,'2',2,'0','默认分区'),(183,65,'6',9,'7',7,'0','默认分区'),(184,65,'5',10,'6',6,'5806','黄金区'),(185,65,'5',10,'5',5,'5806','黄金区'),(186,66,'1',18,'7',7,'0','默认分区'),(187,66,'6',21,'9',9,'0','默认分区'),(188,67,'4',8,'6',6,'5806','黄金区'),(189,67,'6',10,'7',7,'5806','黄金区'),(190,69,'7',8,'3',3,'a',''),(191,69,'6',7,'3',3,'a',''),(192,70,'5',6,'5',5,'0','默认分区'),(193,70,'3',7,'6',6,'0','默认分区'),(194,71,'6',10,'3',4,'1','默认区域'),(195,71,'7',11,'4',5,'1','默认区域'),(196,72,'7',7,'3',3,'0','普通区'),(197,72,'8',8,'3',3,'0','普通区'),(198,73,'6',12,'4',4,'0','普通区'),(199,74,'9',9,'3',3,'0','普通区'),(200,75,'11',7,'3',3,'1',''),(201,75,'10',8,'3',3,'1',''),(202,75,'9',9,'3',3,'1',''),(203,76,'1',17,'3',3,'1',''),(204,76,'3',14,'6',7,'1',''),(205,77,'06',8,'3',3,'0','默认分区'),(206,77,'05',9,'3',3,'0','默认分区'),(207,78,'08',6,'2',2,'0','默认分区'),(208,78,'06',8,'3',3,'0','默认分区'),(209,79,'9',11,'1',1,'1','默认区域'),(210,79,'8',10,'2',2,'1','默认区域'),(211,80,'4',6,'2',3,'9999999999','默认分区'),(212,80,'3',5,'2',3,'9999999999','默认分区'),(213,81,'6',6,'3',3,'1','普通'),(214,81,'7',7,'3',3,'1','普通'),(215,81,'7',7,'4',4,'1','普通'),(216,81,'8',8,'4',4,'1','普通'),(217,81,'8',8,'3',3,'1','普通'),(218,82,'9',9,'2',2,'1','普通'),(219,82,'10',10,'3',3,'1','普通'),(220,83,'6',5,'C',3,'3076','优享区'),(221,84,'05',7,'7',7,'0000000000000001',''),(222,85,'6',6,'3',3,'1','普通'),(223,85,'7',7,'3',3,'1','普通'),(224,85,'9',9,'3',3,'1','普通');
/*!40000 ALTER TABLE `seat` ENABLE KEYS */;

#
# Structure for table "user"
#

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `gender` int(11) NOT NULL,
  `headIcon` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `birthday` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `accountName` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `nickName` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `uid` int(11) NOT NULL,
  `userId` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `balance` int(11) DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='用户表';

#
# Data for table "user"
#

/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'https://n.sinaimg.cn/sinacn20121/560/w1080h1080/20191014/6039-ifvwftk8935103.jpg','1','1','1','1','打死臭臭猪',1,'12345678',10000);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;

#
# Structure for table "user_coupon"
#

DROP TABLE IF EXISTS `user_coupon`;
CREATE TABLE `user_coupon` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `couponId` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

#
# Data for table "user_coupon"
#

/*!40000 ALTER TABLE `user_coupon` DISABLE KEYS */;
INSERT INTO `user_coupon` VALUES (1,1,1),(2,1,2);
/*!40000 ALTER TABLE `user_coupon` ENABLE KEYS */;

#
# Structure for table "user_order"
#

DROP TABLE IF EXISTS `user_order`;
CREATE TABLE `user_order` (
  `id` int(11) NOT NULL,
  `orderId` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

#
# Data for table "user_order"
#


#
# Procedure "NewProcedure"
#

DROP PROCEDURE IF EXISTS `NewProcedure`;
CREATE PROCEDURE `NewProcedure`(Param int(11))
BEGIN
    UPDATE 
      `order` AS order_ 
    set
      order_.`status` = '2' 
    WHERE 1 = 1 
      AND order_.status = '0' 
      AND  (UNIX_TIMESTAMP() - order_.createDate) > 10 * 60 ;
END;

#
# Event "NewEvent"
#

DROP EVENT IF EXISTS `NewEvent`;
CREATE EVENT `NewEvent` ON SCHEDULE EVERY 1 MINUTE STARTS '2024-01-04 14:50:00' ON COMPLETION NOT PRESERVE ENABLE DO BEGIN
  call NewProcedure(1);
END;
